Masmiseim36/nxpSDK/boards/frdmk28f/project_template/pin_mux.h
/*! @name PORTC29 (coord B6), U6[4]/I2C_SCL
  @{ */
#define BOARD_I2C_SCL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_I2C_SCL_PIN 29U    /*!<@brief PORTC pin index: 29 */
                                 /* @} */

/*! @name PORTC28 (coord C6), U6[6]/I2C SDA
  @{ */
#define BOARD_I2C_SDA_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_I2C_SDA_PIN 28U    /*!<@brief PORTC pin index: 28 */
                                 /* @} */

/*! @name PORTC26 (coord E6), U6[11]/INT1_FXOS8700CQ_R
  @{ */
#define BOARD_ACCEL_INT1_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_ACCEL_INT1_PIN 26U    /*!<@brief PORTC pin index: 26 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void);

/*! @name PORTE2 (coord C1), U11[5]/QSPIA_DATA0
  @{ */
#define BOARD_QSPIA_DATA0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA0_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                     /* @} */

/*! @name PORTE4 (coord E1), U11[2]/QSPIA_DATA1
  @{ */
#define BOARD_QSPIA_DATA1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA1_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                     /* @} */

/*! @name PORTE3 (coord D1), U11[3]/QSPIA_DATA2
  @{ */
#define BOARD_QSPIA_DATA2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA2_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                     /* @} */

/*! @name PORTE0 (coord A1), U11[7]/QSPIA_DATA3
  @{ */
#define BOARD_QSPIA_DATA3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA3_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                     /* @} */

/*! @name PORTE1 (coord B1), U11[6]/QSPIA_SCLK
  @{ */
#define BOARD_QSPIA_SCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_SCLK_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                    /* @} */

/*! @name PORTE5 (coord D2), U11[1]/QSPIA_SS
  @{ */
#define BOARD_QSPIA_SS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_SS_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASH(void);

/*! @name USB1_VBUS (coord J2), J24[1]P5V0_USB_CONN_VBUS
  @{ */
/* @} */

/*! @name PORTA11 (coord M11), J24[4]TC_USB_ID
  @{ */
#define BOARD_USB_ID_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB_ID_PIN 11U    /*!<@brief PORTA pin index: 11 */
                                /* @} */

/*! @name PORTA22 (coord K8), J27[7]/FXIO0_D6/PCLK
  @{ */
#define BOARD_USB0_CLKIN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB0_CLKIN_PIN 22U    /*!<@brief PORTA pin index: 22 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

/*! @name PORTA29 (coord H11), J19[P1]/SDHC0_D2
  @{ */
#define BOARD_SDHC0_D2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D2_PIN 29U    /*!<@brief PORTA pin index: 29 */
                                  /* @} */

/*! @name PORTA28 (coord H12), J19[P2]/SDHC0_D3
  @{ */
#define BOARD_SDHC0_D3_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D3_PIN 28U    /*!<@brief PORTA pin index: 28 */
                                  /* @} */

/*! @name PORTA25 (coord J11), J19[P7]/SDHC0_D0
  @{ */
#define BOARD_SDHC0_D0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D0_PIN 25U    /*!<@brief PORTA pin index: 25 */
                                  /* @} */

/*! @name PORTA24 (coord K11), J19[P8]/SDHC0_D1
  @{ */
#define BOARD_SDHC0_D1_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D1_PIN 24U    /*!<@brief PORTA pin index: 24 */
                                  /* @} */

/*! @name PORTA26 (coord J10), J19[P5]/SDHC0_DCLK
  @{ */
#define BOARD_SDHC0_DCLK_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_DCLK_PIN 26U    /*!<@brief PORTA pin index: 26 */
                                    /* @} */

/*! @name PORTA27 (coord H13), J19[P3]/SDHC0_CMD
  @{ */
#define BOARD_SDHC0_CMD_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_CMD_PIN 27U    /*!<@brief PORTA pin index: 27 */
                                   /* @} */

/*! @name PORTB5 (coord F13), J19[G1]/SD_CARD_DETECT
  @{ */
#define BOARD_SDCARD_CARD_DETECTION_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_SDCARD_CARD_DETECTION_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDCARD_CARD_DETECTION_PIN 5U     /*!<@brief PORTB pin index: 5 */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC0(void);

/*! @name ADC0_SE16 (coord N4), Q5[2]/LIGHT_SENSOR
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_visible_light(void);

#define PORT_DFER_DFE_2_MASK 0x04u /*!<@brief Digital Filter Enable Mask for item 2. */
#define PORT_DFER_DFE_3_MASK 0x08u /*!<@brief Digital Filter Enable Mask for item 3. */
#define PORT_DFER_DFE_4_MASK 0x10u /*!<@brief Digital Filter Enable Mask for item 4. */
#define PORT_DFER_DFE_5_MASK 0x20u /*!<@brief Digital Filter Enable Mask for item 5. */
#define PORT_DFER_DFE_7_MASK 0x80u /*!<@brief Digital Filter Enable Mask for item 7. */

/*! @name PORTC7 (coord B10), U13[H7]/SDRAM_A16
  @{ */
#define BOARD_SDRAM_A16_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A16_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                   /* @} */

/*! @name PORTC8 (coord C10), U13[H8]/SDRAM_A15
  @{ */
#define BOARD_SDRAM_A15_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A15_PIN 8U     /*!<@brief PORTC pin index: 8 */
                                   /* @} */

/*! @name PORTC9 (coord C9), U13[J8]/SDRAM_A14
  @{ */
#define BOARD_SDRAM_A14_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A14_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                   /* @} */

/*! @name PORTC10 (coord A8), U13[J7]/SDRAM_A13
  @{ */
#define BOARD_SDRAM_A13_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A13_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                   /* @} */

